//===========================================================================
// Заготовка модуля XDBTDumperPlugin была сгенерирована специальным средством RAD разработки SA2-DE.
// Все права защищены. (2016)
//
// В данном файле представлен исходный текст основного заголовочного файла модуля.
//
//	В данном файле представлен паттерн интерфейса класса.
//  Описание класса:
//	Абстрактный класс, характеризующий данные для работы с модулем. Может представлять как входные, так и выходные параметры модуля
// ======================================= //
//       Параметры новой разработки.
// ======================================= //
// Имя комплекса:  GCAD  (gcd)
// Имя решения:    GCAD_2 (gc3)
// Имя проекта:    Client  (cli)
// Полный SID:     cligc3
// Время создания: 16:30:20
// Дата создания:  2015-10-28
// ======================================= //
// ============================================================================================ //
//                             Параметры ревизии(версии):
// ============================================================================================ //
// [prd]Period:                     02/2016
// [aut]Author:                     Антон Першин
// [did]DeveloperID:                ap
// [pid]ProblemID:                  00001
// [rvs = did.date.pid]Revision:    //#ap.2016-02-29.00001
// [dsc]Description:                Класс плагина для выгрузки xdbt-файлов.
// [ccm]CodeComment:                rvs.{[s]Start | [e]End | []}{[n]New | [o]Old | [d]Develop}
// ============================================================================================ //

//========================================================================
// ДОПОЛНИТЕЛЬНЫЕ ПОДКЛЮЧЕНИЯ (Типы и модули, необходимые для .h - файла)
//------------------------------------------------------------------------
#include "comaps_cls_GraphSolverWebHandler.h"

using namespace std;
//========================================================================
extern "C" MAC_DLLEXPORT ifc_BasePlugin* _RegisterPlugin(void* p_input_param)
{
    return new cls_GraphSolverWebHandler();
}

//========================================================================
